tutorials/inter4NFFoam/microchannelHeatTransfer/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  NF4Foam;

phase1//water; it is not read
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.004e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 998.2;
}

phase2//air; it is not read
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.461e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.225;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0365;

Prt		Prt [ 0 0 0 0 0 0 0 ]	0.85;
Sct		Sct [ 0 0 0 0 0 0 0 ]	0.85;

// ************************************************************************* //
