tutorials/inter4NFFoam/microchannelHeatTransfer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletu
    {
        type            fixedValue;
        value           uniform (0 -0.005 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0.04 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    topLeft
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    topRight
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    upperWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }

    frontAndBacku
    {
        type            empty;
    }
}


// ************************************************************************* //
