tutorials/inter4NFFoam/microchannelHeatTransfer/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 0 0 1 0 0 0];

internalField		uniform 300.0;

boundaryField
{
    inletu
    {
        type            fixedValue;
        value           uniform 302;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    topLeft
    {
        type            zeroGradient;
    }

    topRight
    {
        type            zeroGradient;
    }

    upperWalls
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }

    frontAndBacku
    {
        type            empty;
    }
}
// ************************************************************************* //
