tutorials/inter4NFFoam/microchannelHeatTransfer/0/alpha2_Ag
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1_Ag;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 0 0 0 0 0 0];

internalField		uniform 0.0;

boundaryField
{
    inletu
    {
        type            fixedValue;
        value           uniform 0;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    ".*"
    {
	type		zeroGradient;
    }

    frontAndBack
    {
        type            empty;
        //type            zeroGradient;
    }

    frontAndBacku
    {
        type            empty;
        //type            zeroGradient;
    }
}
// ************************************************************************* //
